app/views/communes/index.html.erb

SELECT "communes".* FROM "communes" WHERE "communes"."region_id" = $1  [["region_id", 1]]
---
<h1>Liste de toutes les commune : </h1>
<% @region.communes.each do |commune| %>