app/views/communes/result.html.erb

    <%= commune.name %>
    <% commune.fokontanies.each do |fokontany| %>
	    <% fokontany.recensements.each do |recensement|
		   k += recensement.votes.count %>
---
SELECT "fokontanies".* FROM "fokontanies" WHERE "fokontanies"."commune_id" = $1  [["commune_id", 1]]
SELECT "recensements".* FROM "recensements" WHERE "recensements"."fokontany_id" = $1  [["fokontany_id", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."recensement_id" = $1  [["recensement_id", 13]]