app/views/fokontanies/index.html.erb

SELECT "fokontanies".* FROM "fokontanies" WHERE "fokontanies"."commune_id" = $1  [["commune_id", 3]]
---

<% @commune.fokontanies.each do |fokontany| %>