app/views/home/index.html.erb

SELECT  "daties".* FROM "daties" ORDER BY "daties"."id" DESC LIMIT $1  [["LIMIT", 1]]
---

<% @date = Daty.last %>

SELECT COUNT(*) FROM "votes" WHERE "votes"."candidat_id" = $1  [["candidat_id", 1]]
---
                      <p class="card-text" id="scroll"><%=candidat.description%></p>
                      <p> <span class="btn btn-primary"><%= candidat.votes.count %></span>

SELECT COUNT(*) FROM "votes" WHERE "votes"."candidat_id" = $1  [["candidat_id", 1]]
---
                    <p class="card-text" id="scroll"><%=candidat.description%></p>
                    <p> <span class="btn btn-outline-primary"><%= candidat.votes.count%></span>

SELECT  "daties".* FROM "daties" ORDER BY "daties"."id" DESC LIMIT $1  [["LIMIT", 1]]
---

        <% @date = Daty.last %>