app/views/home/index.html.erb

SELECT  "daties".* FROM "daties" ORDER BY "daties"."id" DESC LIMIT $1  [["LIMIT", 1]]
---

        <% @date = Daty.last %>