app/controllers/communes_controller.rb

	def index
		@region = Region.find_by(id: params[:region_id])
---
SELECT  "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def result
		@commune = Commune.all
---
SELECT "communes".* FROM "communes"