app/controllers/fokontanies_controller.rb

SELECT  "communes".* FROM "communes" WHERE "communes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
  	@commune = Commune.find(id: params[:id_commune])