app/controllers/home_controller.rb

  def index
    @date = Daty.last
    @liste = Candidat.all
    @total = 0
    @liste.each do |candidat|
    	@total += candidat.votes.count
---
SELECT  "daties".* FROM "daties" ORDER BY "daties"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "candidats".* FROM "candidats"
SELECT COUNT(*) FROM "votes" WHERE "votes"."candidat_id" = $1  [["candidat_id", 1]]