app/controllers/recensements_controller.rb

  def index
    @fokontany = Fokontany.find_by(id: params[:fokontany_id])

	  @q = @fokontany.recensements.search(params[:q])
---
SELECT  "fokontanies".* FROM "fokontanies" WHERE "fokontanies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "recensements".* FROM "recensements" WHERE "recensements"."fokontany_id" = $1  [["fokontany_id", 3]]

  def show
    @recensements = Recensement.find(params[:id])
    @fokontany = Fokontany.find_by(id: params[:fokontany_id])
---
SELECT  "recensements".* FROM "recensements" WHERE "recensements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "fokontanies".* FROM "fokontanies" WHERE "fokontanies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def testes
    @recensements = Recensement.find_by(id: params[:id])
---
SELECT  "recensements".* FROM "recensements" WHERE "recensements"."id" IS NULL LIMIT $1  [["LIMIT", 1]]