app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"
---
	def index
		@region = Region.all

SELECT "regions".* FROM "regions"
---
	def result
		@region = Region.all