app/views/regions/result.html.erb

SELECT "communes".* FROM "communes" WHERE "communes"."region_id" = $1  [["region_id", 1]]
---
    <%= region.name %>
    <% region.communes.each do |commune|%>

SELECT "fokontanies".* FROM "fokontanies" WHERE "fokontanies"."commune_id" = $1  [["commune_id", 1]]
SELECT "recensements".* FROM "recensements" WHERE "recensements"."fokontany_id" = $1  [["fokontany_id", 3]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."recensement_id" = $1  [["recensement_id", 13]]
---
        <%= commune.name %>
        <% commune.fokontanies.each do |fokontany| %>
        <% fokontany.recensements.each do |recensement|
    k += recensement.votes.count %>