app/views/layouts/application.html.erb

SELECT  "daties".* FROM "daties" ORDER BY "daties"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
        <ul class="navbar-nav mr-auto">
          <% @date = Daty.last %>